// ignore_for_file: non_constant_identifier_names, unused_import

import 'package:flutter/foundation.dart';
import 'package:techblog/Models/Data_Models.dart';
import 'package:techblog/gen/assets.gen.dart';

Map Posterwidgets = {
  "Poster Image": Assets.images.programming.path,
  "Author": "ملیکا عزیزی",
  "Publish Time": "یک روز پیش",
  "Views": "253",
  "Summary": " دوازده قدم برنامه نویسی یک دوره ی ......."
};

List<Hashtag> Hashtaglist = [
  Hashtag(Title: "جاوا"),
  Hashtag(Title: "کاتلین"),
  Hashtag(Title: "وب"),
  Hashtag(Title: "هوش مصنوعی"),
  Hashtag(Title: "IOT"),
  Hashtag(Title: "فلاتر"),
];

List<BlogSample> BlogList = [
  BlogSample(
      id: 1,
      ImageURL:
          "https://imageio.forbes.com/specials-images/dam/imageserve/930116744/960x0.jpg?height=473&width=711&fit=bounds",
      Title:
          """ چرا هوش مصنوعی مهم است؟ چون بنیان و اساس رایانه‌ها را تشکیل می‌دهد. براساس هوش مصنوعی است که رایانه ها این توانایی را دارند که حجم عظیمی از داده‌ها را به کار گیرند و از هوش آموخته شده خود برای اکتشافات بهینه در بهترین زمان استفاده کنند. این فناوری بسیار قدیمی‌تر از آن چیزی است که می‌توانید تصور کنید.هوش مصنوعی این امکان را برای ماشین‌ها فراهم می‌کند که با ورودی‌های جدید سازگار شوند و کارهایی شبیه انسان را انجام دهند. بیایید نگاهی به تکامل این فناوری تکان دهنده بیاندازیم:

اولین کاری که در حوزه هوش مصنوعی صورت گرفت  در سال 1943 توسط زنی به نام McCulloch و Walter Pits انجام شد. آنها مدلی از نورون‌های هوش مصنوعی را پیشنهاد کردند.در سال 1949 Donald Hebb قانونی را برای آپدیت و اصلاح قدرت اتصال بین نورون‌ها  نشان داد. قوانین او اکنون یادگیری Hebbian نامیده می‌شود.در سال 1950 آلن تورینگ، آزمون تورینگ را ابداع کرد، آلن کتاب "ماشین های محاسباتی و هوش" را منتشر کرد که در آن آزمایشی را ارائه داد. این آزمون (آزمون تورینگ) درباره توانایی یک ماشین برای ارائه رفتارهای هوشمند برابر یا غیرقابل تمایز با رفتارهای یک انسان است.تولد هوش مصنوعی در سال 1952 تا 1956: سال 1955 Allen Newell  و Herbet A.simon اولین برنامه هوش مصنوعی را طراحی کردند. این برنامه 38 مورد از 52 مورد ریاضی را ثابت کرده، و برای برخی از قضایا برهان‌های جدید را کشف کرده است.از سال 1956 تا سال 1974 به عنوان دوران طلایی هوش مصنوعی نام برده می شود. پروژه Wabot در سال 1967 رباتی ساخت که می‌توان با استفاده از گیرنده‌های خارجی، چشم‌های مصنوعی و گوش‌ها، فاصله‌ها و جهت اشیا را اندازه گیری کرد. و سیستم مکالمه آن اجازه می‌دهد که با استفاده از یک دهان مصنوعی با یک فرد به زبان ژاپنی صحبت کند.در دهه‌های اول قرن بیست و یکم، دسترسی به حجم زیادی از داده‌ها ،رایانه‌های سریع‌تر و تکنیک‌های پیشرفته‌ی ماشین با موفقیت برای بسیاری از مشکلات در سراسر جهان اعمال شد.تا سال 2016 بازار محصولات سخت افزار و نرم افزار مرتبط با هوش مصنوعی به بیش از 8 میلیارد دلار رسید.""",
      Writer: "کیا",
      WriterImageURL:
          "https://upload.wikimedia.org/wikipedia/commons/9/99/Elon_Musk_Colorado_2022_%28cropped2%29.jpg",
      Date: "2015",
      Content:
          """ چرا هوش مصنوعی مهم است؟ چون بنیان و اساس رایانه‌ها را تشکیل می‌دهد. براساس هوش مصنوعی است که رایانه ها این توانایی را دارند که حجم عظیمی از داده‌ها را به کار گیرند و از هوش آموخته شده خود برای اکتشافات بهینه در بهترین زمان استفاده کنند. این فناوری بسیار قدیمی‌تر از آن چیزی است که می‌توانید تصور کنید.هوش مصنوعی این امکان را برای ماشین‌ها فراهم می‌کند که با ورودی‌های جدید سازگار شوند و کارهایی شبیه انسان را انجام دهند. بیایید نگاهی به تکامل این فناوری تکان دهنده بیاندازیم:

اولین کاری که در حوزه هوش مصنوعی صورت گرفت  در سال 1943 توسط زنی به نام McCulloch و Walter Pits انجام شد. آنها مدلی از نورون‌های هوش مصنوعی را پیشنهاد کردند.در سال 1949 Donald Hebb قانونی را برای آپدیت و اصلاح قدرت اتصال بین نورون‌ها  نشان داد. قوانین او اکنون یادگیری Hebbian نامیده می‌شود.در سال 1950 آلن تورینگ، آزمون تورینگ را ابداع کرد، آلن کتاب "ماشین های محاسباتی و هوش" را منتشر کرد که در آن آزمایشی را ارائه داد. این آزمون (آزمون تورینگ) درباره توانایی یک ماشین برای ارائه رفتارهای هوشمند برابر یا غیرقابل تمایز با رفتارهای یک انسان است.تولد هوش مصنوعی در سال 1952 تا 1956: سال 1955 Allen Newell  و Herbet A.simon اولین برنامه هوش مصنوعی را طراحی کردند. این برنامه 38 مورد از 52 مورد ریاضی را ثابت کرده، و برای برخی از قضایا برهان‌های جدید را کشف کرده است.از سال 1956 تا سال 1974 به عنوان دوران طلایی هوش مصنوعی نام برده می شود. پروژه Wabot در سال 1967 رباتی ساخت که می‌توان با استفاده از گیرنده‌های خارجی، چشم‌های مصنوعی و گوش‌ها، فاصله‌ها و جهت اشیا را اندازه گیری کرد. و سیستم مکالمه آن اجازه می‌دهد که با استفاده از یک دهان مصنوعی با یک فرد به زبان ژاپنی صحبت کند.در دهه‌های اول قرن بیست و یکم، دسترسی به حجم زیادی از داده‌ها ،رایانه‌های سریع‌تر و تکنیک‌های پیشرفته‌ی ماشین با موفقیت برای بسیاری از مشکلات در سراسر جهان اعمال شد.تا سال 2016 بازار محصولات سخت افزار و نرم افزار مرتبط با هوش مصنوعی به بیش از 8 میلیارد دلار رسید.""",
      Views: "250"),
  BlogSample(
      id: 2,
      ImageURL:
          "https://cdn.vox-cdn.com/thumbor/UixJG8lZQVN9qI6pBcxprYOsWeA=/0x0:1920x1080/1200x800/filters:focal(807x387:1113x693)/cdn.vox-cdn.com/uploads/chorus_image/image/68876614/26355890.6.jpeg",
      Title:
          """فرق انیمه و مانگا چیست؟ قبل از تماشای انیمه چه باید بدانیم؟ با دنیای انیمه و تمام اصطلاحات آن در مقاله زومجی آشنا شوید.

انیمه و مانگا در صدر محصولات بصری ژاپن، همچنین به‌عنوان یک خرده فرهنگ جذاب، حالا طرفداران بسیاری در تمام دنیا پیدا کرده است. این استقبال به‌قدری است که سازندگان آثار هم‌رده در سایر کشورها هم به سمت استفاده از المان‌های رایج در دنیای انیمه و مانگا گام برداشته‌اند. حالا و درحالی‌که جایگاه و نفوذ صنعت انیمه و مانگا توجه منفعت‌طلب‌ها را بیشتر از همیشه به سوی خود جلب کرده است باید با دقت بیشتری برای لذت بردن از این مدیوم گسترده گام برداشت. شناخت اجزای ساختاری و ماهیت محتوایی این آثار یکی از ملزومات مهم برای تسلط بیشتر در مورد یک خوراک ذهنی سرگرم‌کننده و البته به همان اندازه تأثیرگذار است، پس چه بهتر که قبل از هر چیز با آگاهی کامل به شناختی بهتر از یک رسانه‌ی همچنان در حال پیشرفت دست یافت.

درپایان فراموش نکنیم که دنیای انیمه با همه‌ی کلیشه‌ها و تکرارها همچنان محلی برای بروز خلاقیت انسان‌های متفکر و بااستعدادی است که از بین تمامی جمعیت انبوه هنرمند فعال در این وادی به درخشش‌هایی خیره‌کننده منجر می‌شوند و خب بیایید از این طلوع بی‌پایان لذت ببریم.""",
      Writer: "کیارش",
      WriterImageURL:
          "https://upload.wikimedia.org/wikipedia/commons/d/dc/Steve_Jobs_Headshot_2010-CROP_%28cropped_2%29.jpg",
      Date: "2017",
      Content:
          """فرق انیمه و مانگا چیست؟ قبل از تماشای انیمه چه باید بدانیم؟ با دنیای انیمه و تمام اصطلاحات آن در مقاله زومجی آشنا شوید.

انیمه و مانگا در صدر محصولات بصری ژاپن، همچنین به‌عنوان یک خرده فرهنگ جذاب، حالا طرفداران بسیاری در تمام دنیا پیدا کرده است. این استقبال به‌قدری است که سازندگان آثار هم‌رده در سایر کشورها هم به سمت استفاده از المان‌های رایج در دنیای انیمه و مانگا گام برداشته‌اند. حالا و درحالی‌که جایگاه و نفوذ صنعت انیمه و مانگا توجه منفعت‌طلب‌ها را بیشتر از همیشه به سوی خود جلب کرده است باید با دقت بیشتری برای لذت بردن از این مدیوم گسترده گام برداشت. شناخت اجزای ساختاری و ماهیت محتوایی این آثار یکی از ملزومات مهم برای تسلط بیشتر در مورد یک خوراک ذهنی سرگرم‌کننده و البته به همان اندازه تأثیرگذار است، پس چه بهتر که قبل از هر چیز با آگاهی کامل به شناختی بهتر از یک رسانه‌ی همچنان در حال پیشرفت دست یافت.

درپایان فراموش نکنیم که دنیای انیمه با همه‌ی کلیشه‌ها و تکرارها همچنان محلی برای بروز خلاقیت انسان‌های متفکر و بااستعدادی است که از بین تمامی جمعیت انبوه هنرمند فعال در این وادی به درخشش‌هایی خیره‌کننده منجر می‌شوند و خب بیایید از این طلوع بی‌پایان لذت ببریم.""",
      Views: "780"),
  BlogSample(
      id: 3,
      ImageURL:
          "https://cdn.litemarkets.com/cache/uploads/blog_post/blog_posts/how-to-become-successful-forex-trader/How-to-become-a-trader-1.jpg?q=75&s=01df507910cb06b08bd70b7a3bbf3237",
      Title:
          """ تریدر یا معامله‌گر (Trader) فردی است که در بازارهای مالی مختلف به تبادل ابزارهای مالی مانند، سهام، اوراق بهادار،‌ ارزهای خارجی، ارزهای دیجیتال و … می‌پردازد. تریدرها با بررسی تغییرات قیمت در بازار دارایی‌های با ارزش و پیش‌بینی روند آن در آینده، دست به معامله می‌زنند.

معمولا یک تریدر حرفه‌ای پیش از هر اقدامی، بازار را به لحاظ فاندامنتال و تکنیکال مورد بررسی قرار می‌دهد و سپس تصمیم به معامله می‌گیرد. یک فرد می‌تواند به شکل تمام وقت در بازارهای مالی به خرید و فروش بپردازد و این شغل اصلی او باشد یا برای کسب درآمد جانبی، ترید در بازارهای سرمایه‌گذاری را به‌عنوان شغلی پاره‌وقت خود انتخاب کند.

از آنجایی که معامله گری در دسته‌ی مشاغل پردرآمد قرار دارد، توجه افراد زیادی را به خود جلب کرده است. در این مقاله با حرفه‌ی تخصصی و پیچیده‌ی معامله گری آشنا خواهید شد. اگر شما هم به فکر فعالیت در این حوزه‌ی هستید با ما همراه باشید چرا که در ادامه‌ی مقال تمام اطلاعات مربوط به شغل معامله گری را مورد بررسی قرار می‌دهیم و به مباحثی از قبیل مهارت‌های کلیدی و ویژگی‌های یک تریدر موفق می‌پردازیم.""",
      Writer: "کیارش ق",
      WriterImageURL:
          "https://upload.wikimedia.org/wikipedia/commons/9/99/Elon_Musk_Colorado_2022_%28cropped2%29.jpg",
      Date: "2018",
      Content:
          """ تریدر یا معامله‌گر (Trader) فردی است که در بازارهای مالی مختلف به تبادل ابزارهای مالی مانند، سهام، اوراق بهادار،‌ ارزهای خارجی، ارزهای دیجیتال و … می‌پردازد. تریدرها با بررسی تغییرات قیمت در بازار دارایی‌های با ارزش و پیش‌بینی روند آن در آینده، دست به معامله می‌زنند.

معمولا یک تریدر حرفه‌ای پیش از هر اقدامی، بازار را به لحاظ فاندامنتال و تکنیکال مورد بررسی قرار می‌دهد و سپس تصمیم به معامله می‌گیرد. یک فرد می‌تواند به شکل تمام وقت در بازارهای مالی به خرید و فروش بپردازد و این شغل اصلی او باشد یا برای کسب درآمد جانبی، ترید در بازارهای سرمایه‌گذاری را به‌عنوان شغلی پاره‌وقت خود انتخاب کند.

از آنجایی که معامله گری در دسته‌ی مشاغل پردرآمد قرار دارد، توجه افراد زیادی را به خود جلب کرده است. در این مقاله با حرفه‌ی تخصصی و پیچیده‌ی معامله گری آشنا خواهید شد. اگر شما هم به فکر فعالیت در این حوزه‌ی هستید با ما همراه باشید چرا که در ادامه‌ی مقال تمام اطلاعات مربوط به شغل معامله گری را مورد بررسی قرار می‌دهیم و به مباحثی از قبیل مهارت‌های کلیدی و ویژگی‌های یک تریدر موفق می‌پردازیم.""",
      Views: "7K"),
  BlogSample(
      id: 4,
      ImageURL:
          "https://media.cnn.com/api/v1/images/stellar/prod/i-stock-1287493837-1.jpg?c=16x9",
      Title:
          """بازی ویدیویی (به انگلیسی: Video game) گونه‌ای سرگرمی تعاملی است که با بهره‌گیری از یک دستگاه الکترونیکی مجهز به پردازشگر یا میکرو کنترلر انجام می‌شود. شمار مخاطبان بازی‌های ویدیویی در سال‌های گذشته افزایش داشته[۱] و بازی‌های ویدیویی به پرهوادارترین سرگرمی تاریخ بشر تبدیل شده‌اند. نخستین بازی ویدیویی تاریخ در سال ۱۹۵۸ میلادی ساخته شد، این بازی یک شبیه‌ساز تنیس بود و گامی شد برای پیشرفت‌های پسین در صنعت بازی‌های ویدیویی. بازی‌های کامپیوتری تنها بخشی کوچکی از بازی های ویدیویی را تشکیل می‌دهند.

پیروزی در ورزش‌های الکترونیک به توانایی و مهارت‌هایی ویژه نیاز دارد. توانایی واکنش سریع و دقیق و تفکر راهبردی مهم‌ترین توانمندی‌های یک ورزشکار الکترونیک موفق است.

از بازی‌های ویدیویی پرآوازه می‌توان به سری اتومبیل دزدی بزرگ (GTA)، سری کال آو دیوتی و اساسینز کرید، در انحصاری‌های پلی‌استیشن می‌توان به دِ لست آف آس و گاد آف وار و در اکس‌باکس به هیلو اشاره کرد.""",
      Writer: "کیارش قر",
      WriterImageURL:
          "https://cdn.britannica.com/99/236599-050-1199AD2C/Mark-Zuckerberg-2019.jpg",
      Date: "2019",
      Content:
          """بازی ویدیویی (به انگلیسی: Video game) گونه‌ای سرگرمی تعاملی است که با بهره‌گیری از یک دستگاه الکترونیکی مجهز به پردازشگر یا میکرو کنترلر انجام می‌شود. شمار مخاطبان بازی‌های ویدیویی در سال‌های گذشته افزایش داشته[۱] و بازی‌های ویدیویی به پرهوادارترین سرگرمی تاریخ بشر تبدیل شده‌اند. نخستین بازی ویدیویی تاریخ در سال ۱۹۵۸ میلادی ساخته شد، این بازی یک شبیه‌ساز تنیس بود و گامی شد برای پیشرفت‌های پسین در صنعت بازی‌های ویدیویی. بازی‌های کامپیوتری تنها بخشی کوچکی از بازی های ویدیویی را تشکیل می‌دهند.

پیروزی در ورزش‌های الکترونیک به توانایی و مهارت‌هایی ویژه نیاز دارد. توانایی واکنش سریع و دقیق و تفکر راهبردی مهم‌ترین توانمندی‌های یک ورزشکار الکترونیک موفق است.

از بازی‌های ویدیویی پرآوازه می‌توان به سری اتومبیل دزدی بزرگ (GTA)، سری کال آو دیوتی و اساسینز کرید، در انحصاری‌های پلی‌استیشن می‌توان به دِ لست آف آس و گاد آف وار و در اکس‌باکس به هیلو اشاره کرد.""",
      Views: "15K"),
  BlogSample(
      id: 5,
      ImageURL:
          "https://m.media-amazon.com/images/M/MV5BNGZmZDI5NzItYWUzYy00MjcwLTk3MWQtYjg2YmZkMzBhYzlhXkEyXkFqcGdeQXVyMTUzMTg2ODkz._V1_.jpg",
      Title:
          """سریال در تلویزیون، رادیو و رسانه خانگی، یک برنامهٔ ادامه‌دار است که پی‌درپی و به صورت قسمت به قسمت پخش می‌شود. سریال‌ها به‌طور معمول از قوس داستانی اصلی پیروی می‌کنند. در جهان، نمایش عامه‌پسند (سریال آبکی) (به انگلیسی: Soap Opera ) برجسته‌ترین شکل سریالهای درام است.""", // و

      Writer: "کیارش قرب",
      WriterImageURL:
          "https://upload.wikimedia.org/wikipedia/commons/e/eb/Stephen_Hawking.StarChild.jpg",
      Date: "2020",
      Content:
          """سریال در تلویزیون، رادیو و رسانه خانگی، یک برنامهٔ ادامه‌دار است که پی‌درپی و به صورت قسمت به قسمت پخش می‌شود. سریال‌ها به‌طور معمول از قوس داستانی اصلی پیروی می‌کنند. در جهان، نمایش عامه‌پسند (سریال آبکی) (به انگلیسی: Soap Opera ) برجسته‌ترین شکل سریالهای درام است.""", // و
      Views: "700"),
  BlogSample(
      id: 6,
      ImageURL:
          "https://thumbor.forbes.com/thumbor/fit-in/900x510/https://www.forbes.com/advisor/wp-content/uploads/2023/07/computer-coding.jpg",
      Title:
          """برنامه‌سازی رایانه‌ای[۱] یا برنامه‌نویسی رایانه‌ای همان فرایند طراحی و ساخت یک برنامه رایانه‌ای اجراپذیر برای به‌دست‌آوردن یک نتیجه رایانشی خاص، یا انجام یک عمل خاص می‌باشد. برنامه‌نویسی شامل عمل‌هایی مثل: تحلیل، ایجاد الگوریتم‌ها، رخ‌نمانگاری دقت الگوریتم‌ها و مصرف منابع و پیاده‌سازی آن الگوریتم‌ها به یک زبان برنامه‌نویسی انتخاب شده‌است (که معمولاً به آن کدگذاری (coding) گفته می‌شود).[۲][۳] کد منبع یک برنامه به یک یا بیش از یک زبان نوشته می‌شود که این زبان برای «برنامه‌نویس» قابل فهم است (به جای کد ماشین که به صورت مستقیم توسط واحد پردازش مرکزی اجرا می‌شود). هدف از برنامه‌نویسی، پیداکردن ترتیبی از دستورالعمل‌ها است که انجام یک عمل را در یک رایانه خودکارسازی می‌کند. این دستورالعمل ها معمولاً برای حل‌کردن یک برنامه داده می شوند و می‌تواند تا حد یک سیستم‌عامل پیچیده توسعه پیدا کنند. بنابراین، یک برنامه‌نویسی حرفه‌ای نیاز به مهارت در چندین موضوع متفاوت دارد که شامل دانش دامنه کاربردی، الگوریتم‌های خاص و منطق صوری است.

برنامه‌نویسی به‌طور خلاصه یعنی تعیین یک سری دستور برای اجرا شدن توسط رایانه به منظور رسیدن به هدفی دلخواه.""",
      Writer: "کیارش قربانی",
      WriterImageURL:
          "https://cdn.britannica.com/99/124299-050-4B4D509F/Linus-Torvalds-2012.jpg",
      Date: "2025",
      Content:
          """برنامه‌سازی رایانه‌ای[۱] یا برنامه‌نویسی رایانه‌ای همان فرایند طراحی و ساخت یک برنامه رایانه‌ای اجراپذیر برای به‌دست‌آوردن یک نتیجه رایانشی خاص، یا انجام یک عمل خاص می‌باشد. برنامه‌نویسی شامل عمل‌هایی مثل: تحلیل، ایجاد الگوریتم‌ها، رخ‌نمانگاری دقت الگوریتم‌ها و مصرف منابع و پیاده‌سازی آن الگوریتم‌ها به یک زبان برنامه‌نویسی انتخاب شده‌است (که معمولاً به آن کدگذاری (coding) گفته می‌شود).[۲][۳] کد منبع یک برنامه به یک یا بیش از یک زبان نوشته می‌شود که این زبان برای «برنامه‌نویس» قابل فهم است (به جای کد ماشین که به صورت مستقیم توسط واحد پردازش مرکزی اجرا می‌شود). هدف از برنامه‌نویسی، پیداکردن ترتیبی از دستورالعمل‌ها است که انجام یک عمل را در یک رایانه خودکارسازی می‌کند. این دستورالعمل ها معمولاً برای حل‌کردن یک برنامه داده می شوند و می‌تواند تا حد یک سیستم‌عامل پیچیده توسعه پیدا کنند. بنابراین، یک برنامه‌نویسی حرفه‌ای نیاز به مهارت در چندین موضوع متفاوت دارد که شامل دانش دامنه کاربردی، الگوریتم‌های خاص و منطق صوری است.

برنامه‌نویسی به‌طور خلاصه یعنی تعیین یک سری دستور برای اجرا شدن توسط رایانه به منظور رسیدن به هدفی دلخواه.""",
      Views: "700K"),
  BlogSample(
      id: 7,
      ImageURL:
          "https://imageio.forbes.com/specials-images/dam/imageserve/930116744/960x0.jpg?height=473&width=711&fit=bounds",
      Title: "سرنوشت هوش مصنوعی",
      Writer: "کیا",
      WriterImageURL:
          "https://upload.wikimedia.org/wikipedia/commons/9/99/Elon_Musk_Colorado_2022_%28cropped2%29.jpg",
      Date: "2015",
      Content:
          """ چرا هوش مصنوعی مهم است؟ چون بنیان و اساس رایانه‌ها را تشکیل می‌دهد. براساس هوش مصنوعی است که رایانه ها این توانایی را دارند که حجم عظیمی از داده‌ها را به کار گیرند و از هوش آموخته شده خود برای اکتشافات بهینه در بهترین زمان استفاده کنند. این فناوری بسیار قدیمی‌تر از آن چیزی است که می‌توانید تصور کنید.هوش مصنوعی این امکان را برای ماشین‌ها فراهم می‌کند که با ورودی‌های جدید سازگار شوند و کارهایی شبیه انسان را انجام دهند. بیایید نگاهی به تکامل این فناوری تکان دهنده بیاندازیم:

اولین کاری که در حوزه هوش مصنوعی صورت گرفت  در سال 1943 توسط زنی به نام McCulloch و Walter Pits انجام شد. آنها مدلی از نورون‌های هوش مصنوعی را پیشنهاد کردند.در سال 1949 Donald Hebb قانونی را برای آپدیت و اصلاح قدرت اتصال بین نورون‌ها  نشان داد. قوانین او اکنون یادگیری Hebbian نامیده می‌شود.در سال 1950 آلن تورینگ، آزمون تورینگ را ابداع کرد، آلن کتاب "ماشین های محاسباتی و هوش" را منتشر کرد که در آن آزمایشی را ارائه داد. این آزمون (آزمون تورینگ) درباره توانایی یک ماشین برای ارائه رفتارهای هوشمند برابر یا غیرقابل تمایز با رفتارهای یک انسان است.تولد هوش مصنوعی در سال 1952 تا 1956: سال 1955 Allen Newell  و Herbet A.simon اولین برنامه هوش مصنوعی را طراحی کردند. این برنامه 38 مورد از 52 مورد ریاضی را ثابت کرده، و برای برخی از قضایا برهان‌های جدید را کشف کرده است.از سال 1956 تا سال 1974 به عنوان دوران طلایی هوش مصنوعی نام برده می شود. پروژه Wabot در سال 1967 رباتی ساخت که می‌توان با استفاده از گیرنده‌های خارجی، چشم‌های مصنوعی و گوش‌ها، فاصله‌ها و جهت اشیا را اندازه گیری کرد. و سیستم مکالمه آن اجازه می‌دهد که با استفاده از یک دهان مصنوعی با یک فرد به زبان ژاپنی صحبت کند.در دهه‌های اول قرن بیست و یکم، دسترسی به حجم زیادی از داده‌ها ،رایانه‌های سریع‌تر و تکنیک‌های پیشرفته‌ی ماشین با موفقیت برای بسیاری از مشکلات در سراسر جهان اعمال شد.تا سال 2016 بازار محصولات سخت افزار و نرم افزار مرتبط با هوش مصنوعی به بیش از 8 میلیارد دلار رسید.""",
      Views: "250"),
  BlogSample(
      id: 8,
      ImageURL:
          "https://imageio.forbes.com/specials-images/dam/imageserve/930116744/960x0.jpg?height=473&width=711&fit=bounds",
      Title: "سرنوشت هوش مصنوعی",
      Writer: "کیا",
      WriterImageURL:
          "https://upload.wikimedia.org/wikipedia/commons/9/99/Elon_Musk_Colorado_2022_%28cropped2%29.jpg",
      Date: "2015",
      Content:
          """ چرا هوش مصنوعی مهم است؟ چون بنیان و اساس رایانه‌ها را تشکیل می‌دهد. براساس هوش مصنوعی است که رایانه ها این توانایی را دارند که حجم عظیمی از داده‌ها را به کار گیرند و از هوش آموخته شده خود برای اکتشافات بهینه در بهترین زمان استفاده کنند. این فناوری بسیار قدیمی‌تر از آن چیزی است که می‌توانید تصور کنید.هوش مصنوعی این امکان را برای ماشین‌ها فراهم می‌کند که با ورودی‌های جدید سازگار شوند و کارهایی شبیه انسان را انجام دهند. بیایید نگاهی به تکامل این فناوری تکان دهنده بیاندازیم:

اولین کاری که در حوزه هوش مصنوعی صورت گرفت  در سال 1943 توسط زنی به نام McCulloch و Walter Pits انجام شد. آنها مدلی از نورون‌های هوش مصنوعی را پیشنهاد کردند.در سال 1949 Donald Hebb قانونی را برای آپدیت و اصلاح قدرت اتصال بین نورون‌ها  نشان داد. قوانین او اکنون یادگیری Hebbian نامیده می‌شود.در سال 1950 آلن تورینگ، آزمون تورینگ را ابداع کرد، آلن کتاب "ماشین های محاسباتی و هوش" را منتشر کرد که در آن آزمایشی را ارائه داد. این آزمون (آزمون تورینگ) درباره توانایی یک ماشین برای ارائه رفتارهای هوشمند برابر یا غیرقابل تمایز با رفتارهای یک انسان است.تولد هوش مصنوعی در سال 1952 تا 1956: سال 1955 Allen Newell  و Herbet A.simon اولین برنامه هوش مصنوعی را طراحی کردند. این برنامه 38 مورد از 52 مورد ریاضی را ثابت کرده، و برای برخی از قضایا برهان‌های جدید را کشف کرده است.از سال 1956 تا سال 1974 به عنوان دوران طلایی هوش مصنوعی نام برده می شود. پروژه Wabot در سال 1967 رباتی ساخت که می‌توان با استفاده از گیرنده‌های خارجی، چشم‌های مصنوعی و گوش‌ها، فاصله‌ها و جهت اشیا را اندازه گیری کرد. و سیستم مکالمه آن اجازه می‌دهد که با استفاده از یک دهان مصنوعی با یک فرد به زبان ژاپنی صحبت کند.در دهه‌های اول قرن بیست و یکم، دسترسی به حجم زیادی از داده‌ها ،رایانه‌های سریع‌تر و تکنیک‌های پیشرفته‌ی ماشین با موفقیت برای بسیاری از مشکلات در سراسر جهان اعمال شد.تا سال 2016 بازار محصولات سخت افزار و نرم افزار مرتبط با هوش مصنوعی به بیش از 8 میلیارد دلار رسید.""",
      Views: "250"),
  BlogSample(
      id: 9,
      ImageURL:
          "https://imageio.forbes.com/specials-images/dam/imageserve/930116744/960x0.jpg?height=473&width=711&fit=bounds",
      Title: "سرنوشت هوش مصنوعی",
      Writer: "کیا",
      WriterImageURL:
          "https://upload.wikimedia.org/wikipedia/commons/9/99/Elon_Musk_Colorado_2022_%28cropped2%29.jpg",
      Date: "2015",
      Content:
          """ چرا هوش مصنوعی مهم است؟ چون بنیان و اساس رایانه‌ها را تشکیل می‌دهد. براساس هوش مصنوعی است که رایانه ها این توانایی را دارند که حجم عظیمی از داده‌ها را به کار گیرند و از هوش آموخته شده خود برای اکتشافات بهینه در بهترین زمان استفاده کنند. این فناوری بسیار قدیمی‌تر از آن چیزی است که می‌توانید تصور کنید.هوش مصنوعی این امکان را برای ماشین‌ها فراهم می‌کند که با ورودی‌های جدید سازگار شوند و کارهایی شبیه انسان را انجام دهند. بیایید نگاهی به تکامل این فناوری تکان دهنده بیاندازیم:

اولین کاری که در حوزه هوش مصنوعی صورت گرفت  در سال 1943 توسط زنی به نام McCulloch و Walter Pits انجام شد. آنها مدلی از نورون‌های هوش مصنوعی را پیشنهاد کردند.در سال 1949 Donald Hebb قانونی را برای آپدیت و اصلاح قدرت اتصال بین نورون‌ها  نشان داد. قوانین او اکنون یادگیری Hebbian نامیده می‌شود.در سال 1950 آلن تورینگ، آزمون تورینگ را ابداع کرد، آلن کتاب "ماشین های محاسباتی و هوش" را منتشر کرد که در آن آزمایشی را ارائه داد. این آزمون (آزمون تورینگ) درباره توانایی یک ماشین برای ارائه رفتارهای هوشمند برابر یا غیرقابل تمایز با رفتارهای یک انسان است.تولد هوش مصنوعی در سال 1952 تا 1956: سال 1955 Allen Newell  و Herbet A.simon اولین برنامه هوش مصنوعی را طراحی کردند. این برنامه 38 مورد از 52 مورد ریاضی را ثابت کرده، و برای برخی از قضایا برهان‌های جدید را کشف کرده است.از سال 1956 تا سال 1974 به عنوان دوران طلایی هوش مصنوعی نام برده می شود. پروژه Wabot در سال 1967 رباتی ساخت که می‌توان با استفاده از گیرنده‌های خارجی، چشم‌های مصنوعی و گوش‌ها، فاصله‌ها و جهت اشیا را اندازه گیری کرد. و سیستم مکالمه آن اجازه می‌دهد که با استفاده از یک دهان مصنوعی با یک فرد به زبان ژاپنی صحبت کند.در دهه‌های اول قرن بیست و یکم، دسترسی به حجم زیادی از داده‌ها ،رایانه‌های سریع‌تر و تکنیک‌های پیشرفته‌ی ماشین با موفقیت برای بسیاری از مشکلات در سراسر جهان اعمال شد.تا سال 2016 بازار محصولات سخت افزار و نرم افزار مرتبط با هوش مصنوعی به بیش از 8 میلیارد دلار رسید.""",
      Views: "250"),
  BlogSample(
      id: 10,
      ImageURL:
          "https://imageio.forbes.com/specials-images/dam/imageserve/930116744/960x0.jpg?height=473&width=711&fit=bounds",
      Title: "سرنوشت هوش مصنوعی",
      Writer: "کیا",
      WriterImageURL:
          "https://upload.wikimedia.org/wikipedia/commons/9/99/Elon_Musk_Colorado_2022_%28cropped2%29.jpg",
      Date: "2015",
      Content:
          """ چرا هوش مصنوعی مهم است؟ چون بنیان و اساس رایانه‌ها را تشکیل می‌دهد. براساس هوش مصنوعی است که رایانه ها این توانایی را دارند که حجم عظیمی از داده‌ها را به کار گیرند و از هوش آموخته شده خود برای اکتشافات بهینه در بهترین زمان استفاده کنند. این فناوری بسیار قدیمی‌تر از آن چیزی است که می‌توانید تصور کنید.هوش مصنوعی این امکان را برای ماشین‌ها فراهم می‌کند که با ورودی‌های جدید سازگار شوند و کارهایی شبیه انسان را انجام دهند. بیایید نگاهی به تکامل این فناوری تکان دهنده بیاندازیم:

اولین کاری که در حوزه هوش مصنوعی صورت گرفت  در سال 1943 توسط زنی به نام McCulloch و Walter Pits انجام شد. آنها مدلی از نورون‌های هوش مصنوعی را پیشنهاد کردند.در سال 1949 Donald Hebb قانونی را برای آپدیت و اصلاح قدرت اتصال بین نورون‌ها  نشان داد. قوانین او اکنون یادگیری Hebbian نامیده می‌شود.در سال 1950 آلن تورینگ، آزمون تورینگ را ابداع کرد، آلن کتاب "ماشین های محاسباتی و هوش" را منتشر کرد که در آن آزمایشی را ارائه داد. این آزمون (آزمون تورینگ) درباره توانایی یک ماشین برای ارائه رفتارهای هوشمند برابر یا غیرقابل تمایز با رفتارهای یک انسان است.تولد هوش مصنوعی در سال 1952 تا 1956: سال 1955 Allen Newell  و Herbet A.simon اولین برنامه هوش مصنوعی را طراحی کردند. این برنامه 38 مورد از 52 مورد ریاضی را ثابت کرده، و برای برخی از قضایا برهان‌های جدید را کشف کرده است.از سال 1956 تا سال 1974 به عنوان دوران طلایی هوش مصنوعی نام برده می شود. پروژه Wabot در سال 1967 رباتی ساخت که می‌توان با استفاده از گیرنده‌های خارجی، چشم‌های مصنوعی و گوش‌ها، فاصله‌ها و جهت اشیا را اندازه گیری کرد. و سیستم مکالمه آن اجازه می‌دهد که با استفاده از یک دهان مصنوعی با یک فرد به زبان ژاپنی صحبت کند.در دهه‌های اول قرن بیست و یکم، دسترسی به حجم زیادی از داده‌ها ،رایانه‌های سریع‌تر و تکنیک‌های پیشرفته‌ی ماشین با موفقیت برای بسیاری از مشکلات در سراسر جهان اعمال شد.تا سال 2016 بازار محصولات سخت افزار و نرم افزار مرتبط با هوش مصنوعی به بیش از 8 میلیارد دلار رسید.""",
      Views: "250"),
  BlogSample(
      id: 11,
      ImageURL:
          "https://imageio.forbes.com/specials-images/dam/imageserve/930116744/960x0.jpg?height=473&width=711&fit=bounds",
      Title: "سرنوشت هوش مصنوعی",
      Writer: "کیا",
      WriterImageURL:
          "https://upload.wikimedia.org/wikipedia/commons/9/99/Elon_Musk_Colorado_2022_%28cropped2%29.jpg",
      Date: "2015",
      Content:
          """ چرا هوش مصنوعی مهم است؟ چون بنیان و اساس رایانه‌ها را تشکیل می‌دهد. براساس هوش مصنوعی است که رایانه ها این توانایی را دارند که حجم عظیمی از داده‌ها را به کار گیرند و از هوش آموخته شده خود برای اکتشافات بهینه در بهترین زمان استفاده کنند. این فناوری بسیار قدیمی‌تر از آن چیزی است که می‌توانید تصور کنید.هوش مصنوعی این امکان را برای ماشین‌ها فراهم می‌کند که با ورودی‌های جدید سازگار شوند و کارهایی شبیه انسان را انجام دهند. بیایید نگاهی به تکامل این فناوری تکان دهنده بیاندازیم:

اولین کاری که در حوزه هوش مصنوعی صورت گرفت  در سال 1943 توسط زنی به نام McCulloch و Walter Pits انجام شد. آنها مدلی از نورون‌های هوش مصنوعی را پیشنهاد کردند.در سال 1949 Donald Hebb قانونی را برای آپدیت و اصلاح قدرت اتصال بین نورون‌ها  نشان داد. قوانین او اکنون یادگیری Hebbian نامیده می‌شود.در سال 1950 آلن تورینگ، آزمون تورینگ را ابداع کرد، آلن کتاب "ماشین های محاسباتی و هوش" را منتشر کرد که در آن آزمایشی را ارائه داد. این آزمون (آزمون تورینگ) درباره توانایی یک ماشین برای ارائه رفتارهای هوشمند برابر یا غیرقابل تمایز با رفتارهای یک انسان است.تولد هوش مصنوعی در سال 1952 تا 1956: سال 1955 Allen Newell  و Herbet A.simon اولین برنامه هوش مصنوعی را طراحی کردند. این برنامه 38 مورد از 52 مورد ریاضی را ثابت کرده، و برای برخی از قضایا برهان‌های جدید را کشف کرده است.از سال 1956 تا سال 1974 به عنوان دوران طلایی هوش مصنوعی نام برده می شود. پروژه Wabot در سال 1967 رباتی ساخت که می‌توان با استفاده از گیرنده‌های خارجی، چشم‌های مصنوعی و گوش‌ها، فاصله‌ها و جهت اشیا را اندازه گیری کرد. و سیستم مکالمه آن اجازه می‌دهد که با استفاده از یک دهان مصنوعی با یک فرد به زبان ژاپنی صحبت کند.در دهه‌های اول قرن بیست و یکم، دسترسی به حجم زیادی از داده‌ها ،رایانه‌های سریع‌تر و تکنیک‌های پیشرفته‌ی ماشین با موفقیت برای بسیاری از مشکلات در سراسر جهان اعمال شد.تا سال 2016 بازار محصولات سخت افزار و نرم افزار مرتبط با هوش مصنوعی به بیش از 8 میلیارد دلار رسید.""",
      Views: "250"),
  BlogSample(
      id: 12,
      ImageURL:
          "https://imageio.forbes.com/specials-images/dam/imageserve/930116744/960x0.jpg?height=473&width=711&fit=bounds",
      Title: "سرنوشت هوش مصنوعی",
      Writer: "کیا",
      WriterImageURL:
          "https://upload.wikimedia.org/wikipedia/commons/9/99/Elon_Musk_Colorado_2022_%28cropped2%29.jpg",
      Date: "2015",
      Content:
          """ چرا هوش مصنوعی مهم است؟ چون بنیان و اساس رایانه‌ها را تشکیل می‌دهد. براساس هوش مصنوعی است که رایانه ها این توانایی را دارند که حجم عظیمی از داده‌ها را به کار گیرند و از هوش آموخته شده خود برای اکتشافات بهینه در بهترین زمان استفاده کنند. این فناوری بسیار قدیمی‌تر از آن چیزی است که می‌توانید تصور کنید.هوش مصنوعی این امکان را برای ماشین‌ها فراهم می‌کند که با ورودی‌های جدید سازگار شوند و کارهایی شبیه انسان را انجام دهند. بیایید نگاهی به تکامل این فناوری تکان دهنده بیاندازیم:

اولین کاری که در حوزه هوش مصنوعی صورت گرفت  در سال 1943 توسط زنی به نام McCulloch و Walter Pits انجام شد. آنها مدلی از نورون‌های هوش مصنوعی را پیشنهاد کردند.در سال 1949 Donald Hebb قانونی را برای آپدیت و اصلاح قدرت اتصال بین نورون‌ها  نشان داد. قوانین او اکنون یادگیری Hebbian نامیده می‌شود.در سال 1950 آلن تورینگ، آزمون تورینگ را ابداع کرد، آلن کتاب "ماشین های محاسباتی و هوش" را منتشر کرد که در آن آزمایشی را ارائه داد. این آزمون (آزمون تورینگ) درباره توانایی یک ماشین برای ارائه رفتارهای هوشمند برابر یا غیرقابل تمایز با رفتارهای یک انسان است.تولد هوش مصنوعی در سال 1952 تا 1956: سال 1955 Allen Newell  و Herbet A.simon اولین برنامه هوش مصنوعی را طراحی کردند. این برنامه 38 مورد از 52 مورد ریاضی را ثابت کرده، و برای برخی از قضایا برهان‌های جدید را کشف کرده است.از سال 1956 تا سال 1974 به عنوان دوران طلایی هوش مصنوعی نام برده می شود. پروژه Wabot در سال 1967 رباتی ساخت که می‌توان با استفاده از گیرنده‌های خارجی، چشم‌های مصنوعی و گوش‌ها، فاصله‌ها و جهت اشیا را اندازه گیری کرد. و سیستم مکالمه آن اجازه می‌دهد که با استفاده از یک دهان مصنوعی با یک فرد به زبان ژاپنی صحبت کند.در دهه‌های اول قرن بیست و یکم، دسترسی به حجم زیادی از داده‌ها ،رایانه‌های سریع‌تر و تکنیک‌های پیشرفته‌ی ماشین با موفقیت برای بسیاری از مشکلات در سراسر جهان اعمال شد.تا سال 2016 بازار محصولات سخت افزار و نرم افزار مرتبط با هوش مصنوعی به بیش از 8 میلیارد دلار رسید.""",
      Views: "250"),
  BlogSample(
      id: 13,
      ImageURL:
          "https://imageio.forbes.com/specials-images/dam/imageserve/930116744/960x0.jpg?height=473&width=711&fit=bounds",
      Title: "سرنوشت هوش مصنوعی",
      Writer: "کیا",
      WriterImageURL:
          "https://upload.wikimedia.org/wikipedia/commons/9/99/Elon_Musk_Colorado_2022_%28cropped2%29.jpg",
      Date: "2015",
      Content:
          """ چرا هوش مصنوعی مهم است؟ چون بنیان و اساس رایانه‌ها را تشکیل می‌دهد. براساس هوش مصنوعی است که رایانه ها این توانایی را دارند که حجم عظیمی از داده‌ها را به کار گیرند و از هوش آموخته شده خود برای اکتشافات بهینه در بهترین زمان استفاده کنند. این فناوری بسیار قدیمی‌تر از آن چیزی است که می‌توانید تصور کنید.هوش مصنوعی این امکان را برای ماشین‌ها فراهم می‌کند که با ورودی‌های جدید سازگار شوند و کارهایی شبیه انسان را انجام دهند. بیایید نگاهی به تکامل این فناوری تکان دهنده بیاندازیم:

اولین کاری که در حوزه هوش مصنوعی صورت گرفت  در سال 1943 توسط زنی به نام McCulloch و Walter Pits انجام شد. آنها مدلی از نورون‌های هوش مصنوعی را پیشنهاد کردند.در سال 1949 Donald Hebb قانونی را برای آپدیت و اصلاح قدرت اتصال بین نورون‌ها  نشان داد. قوانین او اکنون یادگیری Hebbian نامیده می‌شود.در سال 1950 آلن تورینگ، آزمون تورینگ را ابداع کرد، آلن کتاب "ماشین های محاسباتی و هوش" را منتشر کرد که در آن آزمایشی را ارائه داد. این آزمون (آزمون تورینگ) درباره توانایی یک ماشین برای ارائه رفتارهای هوشمند برابر یا غیرقابل تمایز با رفتارهای یک انسان است.تولد هوش مصنوعی در سال 1952 تا 1956: سال 1955 Allen Newell  و Herbet A.simon اولین برنامه هوش مصنوعی را طراحی کردند. این برنامه 38 مورد از 52 مورد ریاضی را ثابت کرده، و برای برخی از قضایا برهان‌های جدید را کشف کرده است.از سال 1956 تا سال 1974 به عنوان دوران طلایی هوش مصنوعی نام برده می شود. پروژه Wabot در سال 1967 رباتی ساخت که می‌توان با استفاده از گیرنده‌های خارجی، چشم‌های مصنوعی و گوش‌ها، فاصله‌ها و جهت اشیا را اندازه گیری کرد. و سیستم مکالمه آن اجازه می‌دهد که با استفاده از یک دهان مصنوعی با یک فرد به زبان ژاپنی صحبت کند.در دهه‌های اول قرن بیست و یکم، دسترسی به حجم زیادی از داده‌ها ،رایانه‌های سریع‌تر و تکنیک‌های پیشرفته‌ی ماشین با موفقیت برای بسیاری از مشکلات در سراسر جهان اعمال شد.تا سال 2016 بازار محصولات سخت افزار و نرم افزار مرتبط با هوش مصنوعی به بیش از 8 میلیارد دلار رسید.""",
      Views: "250"),
  BlogSample(
      id: 14,
      ImageURL:
          "https://imageio.forbes.com/specials-images/dam/imageserve/930116744/960x0.jpg?height=473&width=711&fit=bounds",
      Title: "سرنوشت هوش مصنوعی",
      Writer: "کیا",
      WriterImageURL:
          "https://upload.wikimedia.org/wikipedia/commons/9/99/Elon_Musk_Colorado_2022_%28cropped2%29.jpg",
      Date: "2015",
      Content:
          """ چرا هوش مصنوعی مهم است؟ چون بنیان و اساس رایانه‌ها را تشکیل می‌دهد. براساس هوش مصنوعی است که رایانه ها این توانایی را دارند که حجم عظیمی از داده‌ها را به کار گیرند و از هوش آموخته شده خود برای اکتشافات بهینه در بهترین زمان استفاده کنند. این فناوری بسیار قدیمی‌تر از آن چیزی است که می‌توانید تصور کنید.هوش مصنوعی این امکان را برای ماشین‌ها فراهم می‌کند که با ورودی‌های جدید سازگار شوند و کارهایی شبیه انسان را انجام دهند. بیایید نگاهی به تکامل این فناوری تکان دهنده بیاندازیم:

اولین کاری که در حوزه هوش مصنوعی صورت گرفت  در سال 1943 توسط زنی به نام McCulloch و Walter Pits انجام شد. آنها مدلی از نورون‌های هوش مصنوعی را پیشنهاد کردند.در سال 1949 Donald Hebb قانونی را برای آپدیت و اصلاح قدرت اتصال بین نورون‌ها  نشان داد. قوانین او اکنون یادگیری Hebbian نامیده می‌شود.در سال 1950 آلن تورینگ، آزمون تورینگ را ابداع کرد، آلن کتاب "ماشین های محاسباتی و هوش" را منتشر کرد که در آن آزمایشی را ارائه داد. این آزمون (آزمون تورینگ) درباره توانایی یک ماشین برای ارائه رفتارهای هوشمند برابر یا غیرقابل تمایز با رفتارهای یک انسان است.تولد هوش مصنوعی در سال 1952 تا 1956: سال 1955 Allen Newell  و Herbet A.simon اولین برنامه هوش مصنوعی را طراحی کردند. این برنامه 38 مورد از 52 مورد ریاضی را ثابت کرده، و برای برخی از قضایا برهان‌های جدید را کشف کرده است.از سال 1956 تا سال 1974 به عنوان دوران طلایی هوش مصنوعی نام برده می شود. پروژه Wabot در سال 1967 رباتی ساخت که می‌توان با استفاده از گیرنده‌های خارجی، چشم‌های مصنوعی و گوش‌ها، فاصله‌ها و جهت اشیا را اندازه گیری کرد. و سیستم مکالمه آن اجازه می‌دهد که با استفاده از یک دهان مصنوعی با یک فرد به زبان ژاپنی صحبت کند.در دهه‌های اول قرن بیست و یکم، دسترسی به حجم زیادی از داده‌ها ،رایانه‌های سریع‌تر و تکنیک‌های پیشرفته‌ی ماشین با موفقیت برای بسیاری از مشکلات در سراسر جهان اعمال شد.تا سال 2016 بازار محصولات سخت افزار و نرم افزار مرتبط با هوش مصنوعی به بیش از 8 میلیارد دلار رسید.""",
      Views: "250"),
  BlogSample(
      id: 15,
      ImageURL:
          "https://imageio.forbes.com/specials-images/dam/imageserve/930116744/960x0.jpg?height=473&width=711&fit=bounds",
      Title: "سرنوشت هوش مصنوعی",
      Writer: "کیا",
      WriterImageURL:
          "https://upload.wikimedia.org/wikipedia/commons/9/99/Elon_Musk_Colorado_2022_%28cropped2%29.jpg",
      Date: "2015",
      Content:
          """ چرا هوش مصنوعی مهم است؟ چون بنیان و اساس رایانه‌ها را تشکیل می‌دهد. براساس هوش مصنوعی است که رایانه ها این توانایی را دارند که حجم عظیمی از داده‌ها را به کار گیرند و از هوش آموخته شده خود برای اکتشافات بهینه در بهترین زمان استفاده کنند. این فناوری بسیار قدیمی‌تر از آن چیزی است که می‌توانید تصور کنید.هوش مصنوعی این امکان را برای ماشین‌ها فراهم می‌کند که با ورودی‌های جدید سازگار شوند و کارهایی شبیه انسان را انجام دهند. بیایید نگاهی به تکامل این فناوری تکان دهنده بیاندازیم:

اولین کاری که در حوزه هوش مصنوعی صورت گرفت  در سال 1943 توسط زنی به نام McCulloch و Walter Pits انجام شد. آنها مدلی از نورون‌های هوش مصنوعی را پیشنهاد کردند.در سال 1949 Donald Hebb قانونی را برای آپدیت و اصلاح قدرت اتصال بین نورون‌ها  نشان داد. قوانین او اکنون یادگیری Hebbian نامیده می‌شود.در سال 1950 آلن تورینگ، آزمون تورینگ را ابداع کرد، آلن کتاب "ماشین های محاسباتی و هوش" را منتشر کرد که در آن آزمایشی را ارائه داد. این آزمون (آزمون تورینگ) درباره توانایی یک ماشین برای ارائه رفتارهای هوشمند برابر یا غیرقابل تمایز با رفتارهای یک انسان است.تولد هوش مصنوعی در سال 1952 تا 1956: سال 1955 Allen Newell  و Herbet A.simon اولین برنامه هوش مصنوعی را طراحی کردند. این برنامه 38 مورد از 52 مورد ریاضی را ثابت کرده، و برای برخی از قضایا برهان‌های جدید را کشف کرده است.از سال 1956 تا سال 1974 به عنوان دوران طلایی هوش مصنوعی نام برده می شود. پروژه Wabot در سال 1967 رباتی ساخت که می‌توان با استفاده از گیرنده‌های خارجی، چشم‌های مصنوعی و گوش‌ها، فاصله‌ها و جهت اشیا را اندازه گیری کرد. و سیستم مکالمه آن اجازه می‌دهد که با استفاده از یک دهان مصنوعی با یک فرد به زبان ژاپنی صحبت کند.در دهه‌های اول قرن بیست و یکم، دسترسی به حجم زیادی از داده‌ها ،رایانه‌های سریع‌تر و تکنیک‌های پیشرفته‌ی ماشین با موفقیت برای بسیاری از مشکلات در سراسر جهان اعمال شد.تا سال 2016 بازار محصولات سخت افزار و نرم افزار مرتبط با هوش مصنوعی به بیش از 8 میلیارد دلار رسید.""",
      Views: "250"),
  BlogSample(
      id: 16,
      ImageURL:
          "https://imageio.forbes.com/specials-images/dam/imageserve/930116744/960x0.jpg?height=473&width=711&fit=bounds",
      Title: "سرنوشت هوش مصنوعی",
      Writer: "کیا",
      WriterImageURL:
          "https://upload.wikimedia.org/wikipedia/commons/9/99/Elon_Musk_Colorado_2022_%28cropped2%29.jpg",
      Date: "2015",
      Content:
          """ چرا هوش مصنوعی مهم است؟ چون بنیان و اساس رایانه‌ها را تشکیل می‌دهد. براساس هوش مصنوعی است که رایانه ها این توانایی را دارند که حجم عظیمی از داده‌ها را به کار گیرند و از هوش آموخته شده خود برای اکتشافات بهینه در بهترین زمان استفاده کنند. این فناوری بسیار قدیمی‌تر از آن چیزی است که می‌توانید تصور کنید.هوش مصنوعی این امکان را برای ماشین‌ها فراهم می‌کند که با ورودی‌های جدید سازگار شوند و کارهایی شبیه انسان را انجام دهند. بیایید نگاهی به تکامل این فناوری تکان دهنده بیاندازیم:

اولین کاری که در حوزه هوش مصنوعی صورت گرفت  در سال 1943 توسط زنی به نام McCulloch و Walter Pits انجام شد. آنها مدلی از نورون‌های هوش مصنوعی را پیشنهاد کردند.در سال 1949 Donald Hebb قانونی را برای آپدیت و اصلاح قدرت اتصال بین نورون‌ها  نشان داد. قوانین او اکنون یادگیری Hebbian نامیده می‌شود.در سال 1950 آلن تورینگ، آزمون تورینگ را ابداع کرد، آلن کتاب "ماشین های محاسباتی و هوش" را منتشر کرد که در آن آزمایشی را ارائه داد. این آزمون (آزمون تورینگ) درباره توانایی یک ماشین برای ارائه رفتارهای هوشمند برابر یا غیرقابل تمایز با رفتارهای یک انسان است.تولد هوش مصنوعی در سال 1952 تا 1956: سال 1955 Allen Newell  و Herbet A.simon اولین برنامه هوش مصنوعی را طراحی کردند. این برنامه 38 مورد از 52 مورد ریاضی را ثابت کرده، و برای برخی از قضایا برهان‌های جدید را کشف کرده است.از سال 1956 تا سال 1974 به عنوان دوران طلایی هوش مصنوعی نام برده می شود. پروژه Wabot در سال 1967 رباتی ساخت که می‌توان با استفاده از گیرنده‌های خارجی، چشم‌های مصنوعی و گوش‌ها، فاصله‌ها و جهت اشیا را اندازه گیری کرد. و سیستم مکالمه آن اجازه می‌دهد که با استفاده از یک دهان مصنوعی با یک فرد به زبان ژاپنی صحبت کند.در دهه‌های اول قرن بیست و یکم، دسترسی به حجم زیادی از داده‌ها ،رایانه‌های سریع‌تر و تکنیک‌های پیشرفته‌ی ماشین با موفقیت برای بسیاری از مشکلات در سراسر جهان اعمال شد.تا سال 2016 بازار محصولات سخت افزار و نرم افزار مرتبط با هوش مصنوعی به بیش از 8 میلیارد دلار رسید.""",
      Views: "250"),
];

List<PodcastSample> PodcastList = [
  PodcastSample(
      id: 1,
      ImageURL: Assets.images.ramzun.provider(),
      Title: "رمزون",
      Writer: "سیاوش امیریان",
      WriterImageURL: " ",
      Date: " ",
      Content: " ",
      Views: "278"),
  PodcastSample(
      id: 2,
      ImageURL: Assets.images.codeyad.provider(),
      Title: "رادیو کدیاد",
      Writer: "رضا عزیزی",
      WriterImageURL: " ",
      Date: " ",
      Content: " ",
      Views: "741"),
  PodcastSample(
      id: 3,
      ImageURL: Assets.images.geek.provider(),
      Title: "رادیو گیک",
      Writer: "جادی میرمیرانی",
      WriterImageURL: " ",
      Date: " ",
      Content: " ",
      Views: "1K"),
  PodcastSample(
      id: 4,
      ImageURL: Assets.images.meta.provider(),
      Title: "رادیو متا",
      Writer: "بهزاد کریمخانی",
      WriterImageURL: " ",
      Date: " ",
      Content: " ",
      Views: "500"),
  PodcastSample(
      id: 1,
      ImageURL: Assets.images.programming.provider(),
      Title: "رمزون",
      Writer: "سیاوش امیریان",
      WriterImageURL: " ",
      Date: " ",
      Content: " ",
      Views: "278"),
  PodcastSample(
      id: 1,
      ImageURL: Assets.images.programming.provider(),
      Title: "رمزون",
      Writer: "سیاوش امیریان",
      WriterImageURL: " ",
      Date: " ",
      Content: " ",
      Views: "278"),
  PodcastSample(
      id: 1,
      ImageURL: Assets.images.programming.provider(),
      Title: "رمزون",
      Writer: "سیاوش امیریان",
      WriterImageURL: " ",
      Date: " ",
      Content: " ",
      Views: "278"),
  PodcastSample(
      id: 1,
      ImageURL: Assets.images.programming.provider(),
      Title: "رمزون",
      Writer: "سیاوش امیریان",
      WriterImageURL: " ",
      Date: " ",
      Content: " ",
      Views: "278"),
  PodcastSample(
      id: 1,
      ImageURL: Assets.images.programming.provider(),
      Title: "رمزون",
      Writer: "سیاوش امیریان",
      WriterImageURL: " ",
      Date: " ",
      Content: " ",
      Views: "278"),
  PodcastSample(
      id: 1,
      ImageURL: Assets.images.programming.provider(),
      Title: "رمزون",
      Writer: "سیاوش امیریان",
      WriterImageURL: " ",
      Date: " ",
      Content: " ",
      Views: "278"),
  PodcastSample(
      id: 1,
      ImageURL: Assets.images.programming.provider(),
      Title: "رمزون",
      Writer: "سیاوش امیریان",
      WriterImageURL: " ",
      Date: " ",
      Content: " ",
      Views: "278"),
  PodcastSample(
      id: 1,
      ImageURL: Assets.images.programming.provider(),
      Title: "رمزون",
      Writer: "سیاوش امیریان",
      WriterImageURL: " ",
      Date: " ",
      Content: " ",
      Views: "278"),
  PodcastSample(
      id: 1,
      ImageURL: Assets.images.programming.provider(),
      Title: "رمزون",
      Writer: "سیاوش امیریان",
      WriterImageURL: " ",
      Date: " ",
      Content: " ",
      Views: "278"),
  PodcastSample(
      id: 1,
      ImageURL: Assets.images.programming.provider(),
      Title: "رمزون",
      Writer: "سیاوش امیریان",
      WriterImageURL: " ",
      Date: " ",
      Content: " ",
      Views: "278"),
  PodcastSample(
      id: 1,
      ImageURL: Assets.images.programming.provider(),
      Title: "رمزون",
      Writer: "سیاوش امیریان",
      WriterImageURL: " ",
      Date: " ",
      Content: " ",
      Views: "278"),
  PodcastSample(
      id: 1,
      ImageURL: Assets.images.programming.provider(),
      Title: "رمزون",
      Writer: "سیاوش امیریان",
      WriterImageURL: " ",
      Date: " ",
      Content: " ",
      Views: "278"),
];
